---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.GridLineWeight
source: html/4ada17a6-d26b-858b-050e-47285e2b1eff.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.GridLineWeight Property

Line weight of grid lines.

## Syntax (C#)
```csharp
public int GridLineWeight { get; set; }
```